"use stgrict"

//console.log('number' + 3 + 3) - тут відбувається конкатенація. 'number' - це string, a 3 - це number. 
// Тут просто будуть склеюватися всі значення які додаються 

//console.log(null + 3) - null - це порожність, а нічого+3=3

//console.log(5 && "qwerty") && - логічний оператор AND, який повертає останнє обчислене значення, якщо всі операнди true

//console.log(+'40' + +'2' + "hillel"); унарний + перетворює рядок в число. Також тут використовується конкатенація. Тому результат 42hillel

//console.log('10' - 5 === 6); Оператор мінус передбачає роботу з числами, тому 10-5 = 5. 
// === це оператор строгої рівності (рівність, значення, тип). У відповіді буде false, тому що 5<6, а не дорівнює

//console.log(true + false) - поверне 1. Тому що true рахується як 1, а false - 0, тобто 1+0=1

//console.log('4px' - 3) - тут буде Nan, тому що значення '4рх' не можна перетворити у число і повертає Nan. 
// А будь які операції з Nan повертають Nan

//console.log('4' - 3) Оператор мінус передбачає роботу з числами, тому 4-3=1

//console.log('6' + 3 ** 0) спочатку зводимо до 0-го ступеню число 3 - це буде 1. Потім виконується конкатенація. результат 61

//console.log(12 / '6') як і з мінусом, оператор ділення працює з числами і переводить '6' в число, тому буде 2

//console.log('10' + (5 === 6)) Спочатку виконуємо те що в дужках. 
// 5 не дорівнює 6, тому там буде false. Потім виконується конкатенація і буде 10false

//console.log(null == '') - Порожній рядок ('') - це false, а false перетворюється на 0. null рівний тільки undefined, тому відповідь false

//console.log(3 ** (9 / 3)) Спочатку виконуємо дію в дужках, 9/3=3. 
// Дві зірочки означають зведення в ступінь, тому потім зводимо 3 в 3 ступень = 27

//console.log(!!'false' == !!'true') - 'false' і 'true' - це рядки, тому що в лапках. І в обох булеве значення буде true. 
// !! - інвертує булеве значення два рази. Тобто !!'false' = true і !!'true' = true

//console.log(0 || '0' && 1) - Спочатку обчислює оператор AND. '0' - це рядок, то повертає true. 
// Оператор && перевіряє всіх операндів і якщо усі були правдиві, то повертає останній операнд. В нашому випадку це 1. 
// Потім обчислює оператор ||. Цей оператор знаходить перше правдиве значення і повертає його - це 1.

//console.log((+null == false) < 1) - Тут буде false. Тому що +null = 0, а це false, тобто в рівності (+null == false) буде true. 
// true - це 1. Тому рівність 1 < 1 - хибна.

//console.log(false && true || true) - Пріорітет AND вищий за OR. Тому спочатку перевіряємо  false && true. 
// І тут у нас буде false, оскільки один з операндів false. 
// Потім у нас виконується оператор OR. Тут вже повертаємо true, томущо один з операндів true.

//console.log(false && (false || true)) - Спочатку виконуємо в дужках - буде true. 
// Потім обчислюємо AND - тут буде вже false, оскільки один з операндів false.

//console.log((+null == false) < 1 ** 5) - Тут буде false. Тому що +null = 0, а це false, 
// тобто в рівності (+null == false) буде true. true - це 1. 
// 1 в 5 ступені = 1. Рівність 1<1 - хибна



